crud-ajax/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title like '%Post%')
SELECT "posts".* FROM "posts"
---
  def index
    @post = Post.new
    if params[:search].present?
      @posts = Post.where('title like ?', "%#{params[:search]}%")
    else
      @posts = Post.all

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "post 1"], ["created_at", "2019-04-28 00:24:49.995839"], ["updated_at", "2019-04-28 00:24:49.995839"]]
---
  def create
    @post = Post.create(post_params)

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2019-04-28 00:34:42.877842"], ["id", 35]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)